### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # module.dev-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action                 = "apply_security_profile_group"
      + creation_timestamp     = (known after apply)
      + description            = "Inspect App project - Svc project"
      + direction              = "INGRESS"
      + disabled               = false
      + firewall_policy        = "896163021144"
      + id                     = (known after apply)
      + kind                   = (known after apply)
      + priority               = 4201
      + rule_tuple_count       = (known after apply)
      + security_profile_group = "organizations/872410903863/locations/global/securityProfileGroups/secprof-nsp-threatprevention-1-group"

      + match {
          + dest_ip_ranges = [
              + "10.3.12.0/24",
            ]
          + src_ip_ranges  = [
              + "10.3.22.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "root_folder_id" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*